{
  "quizzes": [
    {
      "name": "While cooking, the pan catches fire. You should:",
      "options": [
        {
          "choice": "Turn off the stove and close the lid.",
          "explanation": "Closing the lid stops oxygen from entering, stopping the fire from being fueled. It also stops the fire from spreading elsewhere.",
          "score": 1
        },
        {
          "choice": "Use salt to put out fire.",
          "explanation": "Salt has the ability to absorb heat and reduce the temperature of the fire, but cannot completely extinguish the fire. As such, salt is often used as a temporary measure in the absence of other fire extinguishing agents.",
          "score": 0.5
        },
        {
          "choice": "Use water to put out fire.",
          "explanation": "When water comes into contact with burning oil, the water will quickly turn into steam and create pressure, intensify and spread the fire. This may cause an explosion or cause the fire to spread beyond control.",
          "score": 0
        },
        {
          "choice": "Move the oil pan to another place.",
          "explanation": "When moving a burning oil pan, flames can erupt and spread quickly, endangering you and those around you. This could lead to fire spread and create an explosion hazard.",
          "score": 0
        }
      ],
      "elements": ["fire"]
    },
    {
      "name": "You are in a high-rise building, suddenly the fire alarm goes off. You should:",
      "options": [
        {
          "choice": "Use the elevator to get down faster.",
          "explanation": "Avoid using the elevator in case of fire. The elevator may become stuck or malfunction in an emergency situation.",
          "score": 0
        },
        {
          "choice": "Run into a room and close the door.",
          "explanation": "Hiding in a room can leave you trapped in a confined space with no escape route. In a closed room, the oxygen supply can be limited, making it very dangerous.",
          "score": 0
        },
        {
          "choice": "Move down using staircases.",
          "explanation": "The firefighters often focuses on firefighting and evacuating people from the lower floors. Moving downstairs helps to get rescue and assistance from the fire department.",
          "score": 1
        },
        {
          "choice": "Run to the balcony.",
          "explanation": "You may attract more attention from rescuers, though it is harder to rescue.",
          "score": 0.5
        }
      ],
      "elements": ["fire"]
    },
    {
      "name": "You are watching TV when suddenly the plug short-circuits and causes a fire. You should:",
      "options": [
        {
          "choice": "Turn off the power and use a fire extinguisher.",
          "explanation": "Immediately turn off the power source to prevent further electrical short circuits and the risk of fire spreading. You can use a CO2 gas fire extinguisher or fire extinguishing powder.",
          "score": 1
        },
        {
          "choice": "Leave immediately and call the fire department.",
          "explanation": "If the situation becomes dangerous and you cannot extinguish the fire, leave the area immediately. Follow the instructions and directions of firefighters and move to a safe location away from the fire hazard.",
          "score": 1
        },
        {
          "choice": "Use water to put out the fire.",
          "explanation": "Avoid using water to put out fire in case of fire due to short circuit. Water can increase the risk of reduced resistance and endanger the operator.",
          "score": 0
        }
      ],
      "elements": ["fire"]
    },
    {
      "name": "You are organising a camp, but the wind makes the fire spread out. You should:",
      "options": [
        {
          "choice": "Evacuate and save yourselves.",
          "explanation": "Even though you are safe, you may forget that the fire is still there and has the potential to cause a large-scale forest fire",
          "score": 0.5
        },
        {
          "choice": "Use soil or water sources nearby to put out the fire.",
          "explanation": "Using soil or water can put out a small fire, but if the fire spreads too quickly, it can be quite difficult to put out the fire and can even cause injury.",
          "score": 0.5
        },
        {
          "choice": "Call the fire department.",
          "explanation": "The fire can still spread further but at least you are safe. The firefighter team has the equipment and skills to handle the situation safely and effectively.",
          "score": 1
        }
      ],
      "elements": ["fire"]
    },
    {
      "name": "You are taking a walk when there are thunder, lightning, strong winds and heavy rain. It seems like a big storm. You should:",
      "options": [
        {
          "choice": "Hide under a large tree.",
          "explanation": "In stormy weather, strong winds and heavy rain can cause trees to fall. Tall trees can attract lightning during stormy weather. If you hide under a tree, there is a risk of endangering your life.",
          "score": 0
        },
        {
          "choice": "Run into a convenience store or nearby building.",
          "explanation": "Buildings can provide safe shelter for you and others during an ongoing storm.",
          "score": 1
        },
        {
          "choice": "Use an umbrella",
          "explanation": "While an umbrella keeps you from being wet, using it during a thunderstorm can increase your risk of getting struck by lightning.",
          "score": 0.5
        }
      ],
      "elements": ["air", "water"]
    },
    {
      "name": "A heavy rain causes flooding where you live. Everything seems to be swept away. You should:",
      "options": [
        {
          "choice": "Try to collect items in the floodwaters.",
          "explanation": "Water currents can be very strong and dangerous. Trying to collect items could leave you swept away by floodwaters and in danger.",
          "score": 0
        },
        {
          "choice": "Hide in your room.",
          "explanation": "Hiding in a room can limit the escape space and even get stuck in there. In case of strong floods, it can cause landslides or collapse.",
          "score": 0
        },
        {
          "choice": "Move to the highest place.",
          "explanation": "Moving to the highest possible place can help you stay away from the risk of being swept away and better observe the situation.",
          "score": 1
        }
      ],
      "elements": ["water"]
    },
    {
      "name": "Your close friend whom you just met the previous day is infected with an infectious disease. You should:",
      "options": [
        {
          "choice": "Go to a medical center.",
          "explanation": "Medical centers can assess exposure risks and provide specific guidance on post-exposure prevention and management measures. They may ask you to undergo testing or health monitoring to ensure the safety of you and the community.",
          "score": 1
        },
        {
          "choice": "Self-isolate at home.",
          "explanation": "Self-isolation at home will help reduce the spread. However, you will not have much information about the disease you have been exposed to and how to deal with it when it occurs.",
          "score": 0.5
        },
        {
          "choice": "It's okay because you don't have any symptoms.",
          "explanation": "Some infectious diseases take a certain amount of time to incubate and develop. Just because you don't have any symptoms yet doesn't mean you are not infected.",
          "score": 0
        }
      ],
      "elements": ["human", "air"]
    },
    {
      "name": "You discover a group of students spaying graffiti on the teacher's car. You should:",
      "options": [
        {
          "choice": "Deal with them yourself.",
          "explanation": "Handling a group of students on your own can lead to conflicts and this can be dangerous for you when you have to confront many people at the same time.",
          "score": 0
        },
        {
          "choice": "Shout loudly for everyone to know.",
          "explanation": "Yelling loudly can increase the risk of conflict with that group of students and is dangerous for you when you become their target.",
          "score": 0
        },
        {
          "choice": "Report to teacher.",
          "explanation": "The teacher can take disciplinary measures to deal with this problem and you will not need to appear.",
          "score": 1
        },
        {
          "choice": "Join them",
          "explanation": "Engage in bad behaviors may violate laws and school regulations. This can lead to serious consequences such as detentions, expels, or legal penalties.",
          "score": 0
        },
        {
          "choice": "Go find other students for help to stop them",
          "explanation": "Although you have additional support to prevent the above action, the act of gathering students to cause fights can negatively affect relationships between students and create unnecessary tension in the classroom.",
          "score": 0.5
        }
      ],
      "elements": ["human"]
    },
    {
      "name": "You are often teased and even physically attacked by your classmates. You should:",
      "options": [
        {
          "choice": "Resist them",
          "explanation": "Fighting back on your own when being bullied can be dangerous and unsafe for you. The bully may become more aggressive and create situations of tension and conflict.",
          "score": 0
        },
        {
          "choice": "Keep quiet because you're afraid your family will be upset.",
          "explanation": "Keeping silent does not solve the problem of bullying. The bully may continue their bad behavior and hurt you. When things get worse, you may be affected psychologically.",
          "score": 0
        },
        {
          "choice": "Prank them back.",
          "explanation": "Playing pranks on a group of bullying students can increase tension and conflict in the situation. This can increase the potential for conflict and is unsafe for everyone.",
          "score": 0
        },
        {
          "choice": "Seek help from adults.",
          "explanation": "Adults can help solving the problems by providing cares, supports, and presenting the problems with those in charge.",
          "score": 1
        },
        {
          "choice": "Share with a friend.",
          "explanation": "Sharing about being bullied can help you receive support from others. They can provide advice, emotional support, and help you find a solution to the situation. However, there may be others who do not agree, trust or support you, and this can increase stress and emotional trauma.",
          "score": 0.5
        }
      ],
      "elements": ["human"]
    },
    {
      "name": "You are in a building when an earthquake occurs. You should:",
      "options": [
        {
          "choice": "Hide under a heavy piece of furniture",
          "explanation": "Doing this can shield you from debris falling from above.",
          "score": 1
        },
        {
          "choice": "Immediately leave the building",
          "explanation": "This could leave you damaged by falling debris.",
          "score": 0.5
        },
        {
          "choice": "Continue like normal",
          "explanation": "This is very dangerous as debris can fall on top of you.",
          "score": 0
        },
        {
          "choice": "Stand in a doorway",
          "explanation": "While this can help, it is considered an out-dated practice.",
          "score": 0.5
        }
      ],
      "elements": ["earth"]
    },
    {
      "name": "You are driving on a road when you noticed that there is a mudslide. You should:",
      "options": [
        {
          "choice": "Speed up to try and outrun the mudslide",
          "explanation": "This can leave you losing control of your vehical and fall off or being swept away.",
          "score": 0
        },
        {
          "choice": "Stop the car and exit on foot",
          "explanation": "This is dangerous as the loose rocks can fall on top of you.",
          "score": 0
        },
        {
          "choice": "Turn around and find an alternate route",
          "explanation": "This is the best option, as while you have to drive a longer route, you will be safe from the mudslide.",
          "score": 1
        }
      ],
      "elements": ["earth"]
    },
    {
      "name": "You are driving on a road when you noticed that there is a mudslide. You should:",
      "options": [
        {
          "choice": "Speed up to try and outrun the mudslide",
          "explanation": "This can leave you losing control of your vehical and fall off or being swept away.",
          "score": 0
        },
        {
          "choice": "Stop the car and exit on foot",
          "explanation": "This is dangerous as the loose rocks can fall on top of you.",
          "score": 0
        },
        {
          "choice": "Turn around and find an alternate route",
          "explanation": "This is the best option, as while you have to drive a longer route, you will be safe from the mudslide.",
          "score": 1
        }
      ],
      "elements": ["earth"]
    },
    {
      "name": "In a medical emergency, it is important to assess the situation before taking any action.",
      "options": [
        {
          "choice": "True",
          "explanation": "It is important to know what the victim is experiencing to know what to do.",
          "score": 1
        },
        {
          "choice": "False",
          "explanation": "It is important to know what the victim is experiencing to know what to do.",
          "score": 0
        }
      ],
      "elements": ["human"]
    },
    {
      "name": "Someone is being shocked by a faulty eletrical wire. You should:",
      "options": [
        {
          "choice": "Call emergency services",
          "explanation": "The experts will solve the situation as cleanly as possible.",
          "score": 1
        },
        {
          "choice": "Seperate the person from the wire",
          "explanation": "There is a risk of elecicuting yourself.",
          "score": 0
        },
        {
          "choice": "Immediately turn off the power source",
          "explanation": "It can be hard to do this, and you may get into legal troubles. It is best to call experts.",
          "score": 0.5
        }
      ],
      "elements": ["fire"]
    },
    {
      "name": "It is safe to drive through flooded areas if you are in a large vehicle.",
      "options": [
        {
          "choice": "True",
          "explanation": "The engine may be dead going through deep bodies of water.",
          "score": 0
        },
        {
          "choice": "False",
          "explanation": "The engine may be dead going through deep bodies of water.",
          "score": 1
        }
      ],
      "elements": ["water"]
    },
    {
      "name": "You are watching TV at home when a thunderstorm occurs. You should:",
      "options": [
        {
          "choice": "Continue like normal",
          "explanation": "Eletrical equipments can be damaged by the lightning.",
          "score": 0
        },
        {
          "choice": "Unplug all electrical devices and use flashlights and battery-powered devices.",
          "explanation": "This can help protecting valuable devices.",
          "score": 1
        }
      ],
      "elements": ["water", "air"]
    },
    {
      "name": "A tornado just formed. You should:",
      "options": [
        {
          "choice": "Stay outside and watch for the tornado",
          "explanation": "It is not safe to observe a tornado from outside. Tornadoes are unpredictable and can change direction or intensify rapidly, putting you at risk.",
          "score": 0
        },
        {
          "choice": "Take shelter in a basement",
          "explanation": "Taking shelter in a basement or interior room on the lowest level of your home provides the most protection from a tornado.",
          "score": 1
        },
        {
          "choice": "Continue like normal",
          "explanation": "This can put your life and the lives of others in danger.",
          "score": 0
        },
        {
          "choice": "Stay in a vehicle and try to outrun the tornado",
          "explanation": "Vehicles are not safe during a tornado, and attempting to outrun a tornado can be extremely risky.",
          "score": 0
        }
      ],
      "elements": ["air"]
    },
    {
      "name": "You are stranded in your vehicle during a snow storm. You should:",
      "options": [
        {
          "choice": "Leave the vehicle and walk to find help",
          "explanation": "This can be dangerous in a snow storm as it increases the risk of getting lost, encountering hazards, or getting frostbite.",
          "score": 0
        },
        {
          "choice": "Stay inside the vehicle and run the engine periodically for warmth",
          "explanation": "This provides shelter and running the engine can provide warmth.",
          "score": 1
        }
      ],
      "elements": ["air"]
    },
    {
      "name": "You are outside when you feel dizzy. It seems like you have a heatstroke. You should:",
      "options": [
        {
          "choice": "Wait it out",
          "explanation": "Heatstroke can quickly escalate and become life-threatening, so waiting for the symptoms to subside on their own is not recommended.",
          "score": 0
        },
        {
          "choice": "Move to a cooler environment",
          "explanation": "If possible, move to an air-conditioned or shaded area to help cool down your body. Avoid staying in direct sunlight or hot and humid places, as this can worsen your condition.",
          "score": 1
        },
        {
          "choice": "Self-medication",
          "explanation": "Attempting to self-medicate with over-the-counter medications or home remedies without proper medical guidance can be risky.",
          "score": 0.5
        }
      ],
      "elements": ["air"]
    }
  ]
}
